In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## DataFrame的创建
- 基于ndarray数组或list列表
- 基于字典

In [6]:
# 题目： 创建四种水果在5个城市的当日价格表
# DataFrame可以理解为二维数组，根据要求，应该创建4行5列或5行4列的二维数组，
# 并指定行标签 index 和 列标签 columns
data = np.random.uniform(0.5, 10, size=(5, 4))
index = np.array(['北京', '西安', '上海', '三亚', '香港']) 
columns = ['梨', '香蕉', '苹果', '西瓜']

prices = DataFrame(np.round(data, 1), 
                   index, 
                   columns)
prices

      梨   香蕉   苹果   西瓜
北京  9.1  6.3  9.4  9.3
西安  1.3  7.9  4.3  6.1
上海  8.0  0.9  1.9  6.6
三亚  8.2  6.3  8.6  7.7
香港  8.3  0.9  5.6  1.7

In [7]:
# 题目二： 创建蔬菜的价格表， 蔬菜包含白菜、辣椒、西红柿、土豆， 
#         其中白菜的价格将[0.5, 4.5], 辣椒-> [2.5, 6.5], 西红柿-> [1.5, 5.5]
#         土豆 -> [0.5, 3.5],  统计10天的价格（从2019-04-01）
# 思考： 行索引是日期， 列索引是蔬菜名， 数据集是二维（10， 4）
index = ['2019-04-%s' %(str(day).rjust(2, '0')) 
         for day in range(1, 11)]
prices2 = DataFrame({
    '白菜': np.round(np.random.uniform(0.5, 4.5, size=10), 1),
    '辣椒': np.round(np.random.uniform(2.5, 6.5, size=10), 1),
    '西红柿': np.round(np.random.uniform(1.5, 5.5, size=10), 1),
    '土豆': np.round(np.random.uniform(0.5, 3.5, size=10), 1),
}, index=index)
prices2

             白菜   辣椒  西红柿   土豆
2019-04-01  4.2  3.5  3.1  0.9
2019-04-02  3.9  3.7  4.7  3.4
2019-04-03  1.2  5.5  2.7  0.9
2019-04-04  4.4  3.4  2.1  1.2
2019-04-05  1.4  6.4  2.6  1.4
2019-04-06  0.9  4.5  4.6  3.5
2019-04-07  2.4  6.3  3.3  0.6
2019-04-08  3.9  3.4  2.6  1.3
2019-04-09  2.7  3.0  3.2  3.0
2019-04-10  2.9  2.8  3.6  0.7

练习4：
根据以下考试成绩表，创建一个DataFrame：
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0

## DataFrame的索引操作
- 列索引
    - df[列标签] 选择指定的单列
    - df[[列标签1, 列标签2, ...]] 选择指定的多列
    - df.loc[:, 列标签1:列标签2]  列的切片
- 行索引
    - df[行标签1：行标签2]  行的切片
    - df.loc[行标签] 选择指定的单行
    - df.loc[[行标签1， 行标签2，...]] 选择指定的多行
    - df.iloc[行下标]
    - df.iloc[[行下标1， 行下标2, ...]]
    - df.iloc[行下标1：行下标2]
- 行列索引
    - df.loc[行标签， 列标签]
    - df.iloc[行下标， 列下标]

In [9]:
# 查询4月4日的所有菜的价格
prices2.loc['2019-04-04']

白菜     4.4
辣椒     3.4
西红柿    2.1
土豆     1.2
Name: 2019-04-04, dtype: float64

In [11]:
# 查看所有天的辣椒和土豆的价格
prices2[['辣椒', '土豆']]

             辣椒   土豆
2019-04-01  3.5  0.9
2019-04-02  3.7  3.4
2019-04-03  5.5  0.9
2019-04-04  3.4  1.2
2019-04-05  6.4  1.4
2019-04-06  4.5  3.5
2019-04-07  6.3  0.6
2019-04-08  3.4  1.3
2019-04-09  3.0  3.0
2019-04-10  2.8  0.7

In [13]:
# 查看前5天的白菜和土豆的价格
prices2.iloc[:5, [0, -1]]

             白菜   土豆
2019-04-01  4.2  0.9
2019-04-02  3.9  3.4
2019-04-03  1.2  0.9
2019-04-04  4.4  1.2
2019-04-05  1.4  1.4

In [22]:
cs = prices2.columns
display(cs)
np.where(cs=='土豆')[0][0]  # 查询土豆在 columns列标签列表中的下标位置

Index(['白菜', '辣椒', '西红柿', '土豆'], dtype='object')

3

In [24]:
prices2['2019-04-02':'2019-04-07']  # 行切片

             白菜   辣椒  西红柿   土豆
2019-04-02  3.9  3.7  4.7  3.4
2019-04-03  1.2  5.5  2.7  0.9
2019-04-04  4.4  3.4  2.1  1.2
2019-04-05  1.4  6.4  2.6  1.4
2019-04-06  0.9  4.5  4.6  3.5
2019-04-07  2.4  6.3  3.3  0.6

In [26]:
prices2.loc['2019-04-07':'2019-04-09',
            '辣椒':'土豆']  # 行+列切片

             辣椒  西红柿   土豆
2019-04-07  6.3  3.3  0.6
2019-04-08  3.4  2.6  1.3
2019-04-09  3.0  3.2  3.0

## DataFrame的运算
- 基本的算术运算符都可以
- 使用DataFrame提供的相关算术运算的函数
    - add()/sub()...
- Series和DataFrame运算时，需要使用算术函数，并指定axis坐标轴

In [31]:
prices / 10

       梨    香蕉    苹果    西瓜
北京  0.91  0.63  0.94  0.93
西安  0.13  0.79  0.43  0.61
上海  0.80  0.09  0.19  0.66
三亚  0.82  0.63  0.86  0.77
香港  0.83  0.09  0.56  0.17

In [33]:
p3 = prices.copy()
p3.loc['三亚', '西瓜'] = None
p3

      梨   香蕉   苹果   西瓜
北京  9.1  6.3  9.4  9.3
西安  1.3  7.9  4.3  6.1
上海  8.0  0.9  1.9  6.6
三亚  8.2  6.3  8.6  NaN
香港  8.3  0.9  5.6  1.7

In [35]:
p3.add(10, fill_value=0)  # 在计算之前填充Nan值

       梨    香蕉    苹果    西瓜
北京  19.1  16.3  19.4  19.3
西安  11.3  17.9  14.3  16.1
上海  18.0  10.9  11.9  16.6
三亚  18.2  16.3  18.6  10.0
香港  18.3  10.9  15.6  11.7

In [40]:
s3 = Series([20, 9, 4.5, 12], index=p3.columns)
s3

梨     20.0
香蕉     9.0
苹果     4.5
西瓜    12.0
dtype: float64

In [43]:
p3

      梨   香蕉   苹果   西瓜
北京  9.1  6.3  9.4  9.3
西安  1.3  7.9  4.3  6.1
上海  8.0  0.9  1.9  6.6
三亚  8.2  6.3  8.6  NaN
香港  8.3  0.9  5.6  1.7

In [42]:
# {0, 1, 'index', 'columns'}
p3.add(s3, axis=1)  # axis=1 表示Series的标签和DataFrame的列标签对齐

       梨    香蕉    苹果    西瓜
北京  29.1  15.3  13.9  21.3
西安  21.3  16.9   8.8  18.1
上海  28.0   9.9   6.4  18.6
三亚  28.2  15.3  13.1   NaN
香港  28.3   9.9  10.1  13.7

In [44]:
s4 = Series([1, 3, 5, 7, 9], index=p3.index)
s4

北京    1
西安    3
上海    5
三亚    7
香港    9
dtype: int64

In [45]:
p3.add(s4, axis='index') # s4的索引与p3的行索引对齐

       梨    香蕉    苹果    西瓜
北京  10.1   7.3  10.4  10.3
西安   4.3  10.9   7.3   9.1
上海  13.0   5.9   6.9  11.6
三亚  15.2  13.3  15.6   NaN
香港  17.3   9.9  14.6  10.7

练习6：
假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。
假设张三期中考试数学被发现作弊，要记为0分，如何实现？
李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？
后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

In [47]:
def create_df(index, columns):
    shape = (len(index), len(columns))
    return DataFrame(np.round( np.random.randint(100, size=shape) ,1),
                    index, columns)

In [48]:
ddd = create_df(['张三', '李四', '王五', '赵六'], 
                ['语文', '数学', '英语'])
ddd2 = create_df(['张三', '李四', '王五', '赵六'], 
                ['语文', '数学', '英语'])

In [49]:
ddd

    语文  数学  英语
张三  39   3   1
李四  92  86  50
王五  68  81  86
赵六  94  21  52

In [50]:
ddd2

    语文  数学  英语
张三  79  52  58
李四  19  58  40
王五  46  18  20
赵六  76   7  12

In [52]:
(ddd+ddd2)/2 # 求期中期末平均值

      语文    数学    英语
张三  59.0  27.5  29.5
李四  55.5  72.0  45.0
王五  57.0  49.5  53.0
赵六  85.0  14.0  32.0

In [53]:
# 假设张三期中考试数学被发现作弊，要记为0分，如何实现？
ddd.loc['张三', '数学'] = 0
ddd

    语文  数学  英语
张三  39   0   1
李四  92  86  50
王五  68  81  86
赵六  94  21  52

In [54]:
# 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？
ddd.loc['李四'] += 100
ddd

     语文   数学   英语
张三   39    0    1
李四  192  186  150
王五   68   81   86
赵六   94   21   52

In [55]:
# 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？
ddd.add(10)

     语文   数学   英语
张三   49   10   11
李四  202  196  160
王五   78   91   96
赵六  104   31   62

## DataFrame处理丢失数据
- df.isnull()  为NaN的数据表示的bool列表
- df.notnull() 非NaN的数据表示的bool列表
- df.fillna()  填充为NaN的数值, 常见指定值、(用现有的数据进行)前/后置填充
- df.dropna()  删除某一行或列中存在NaN值的数据

In [56]:
ddd2

    语文  数学  英语
张三  79  52  58
李四  19  58  40
王五  46  18  20
赵六  76   7  12

In [57]:
# 将李四的语文、王五的数学 设置为NaN-> np.nan/NAN/NaN / None
ddd2.loc['李四', '语文'] = None
ddd2.loc['王五', '数学'] = np.NaN
ddd2

      语文    数学  英语
张三  79.0  52.0  58
李四   NaN  58.0  40
王五  46.0   NaN  20
赵六  76.0   7.0  12

In [62]:
any((True, False, False))  # 多个逻辑运算的 or

True

In [63]:
all((True, False, False))  # and

False

In [64]:
ddd2.isnull().any(axis=0)  # 返回列中存在NaN的信息

语文     True
数学     True
英语    False
dtype: bool

In [65]:
ddd2.loc[:, ddd2.isnull().any(axis=0)]  # 查看哪些列存在Nan值

      语文    数学
张三  79.0  52.0
李四   NaN  58.0
王五  46.0   NaN
赵六  76.0   7.0

In [67]:
# 显示哪些行(哪些同学)存在Nan值（丢失数据）
ddd2[ ddd2.isna().any(axis=1) ]

      语文    数学  英语
李四   NaN  58.0  40
王五  46.0   NaN  20

In [73]:
# 显示哪些行不存在NaN值
ddd2[ddd2.notna().all(axis=1) ]

      语文    数学  英语
张三  79.0  52.0  58
赵六  76.0   7.0  12

In [59]:
ddd2.isna()

       语文     数学     英语
张三  False  False  False
李四   True  False  False
王五  False   True  False
赵六  False  False  False

In [75]:
ddd2.fillna(100)  # 指定value值填充, inplace=False 表示在副本上操作，并返回副本

       语文     数学  英语
张三   79.0   52.0  58
李四  100.0   58.0  40
王五   46.0  100.0  20
赵六   76.0    7.0  12

In [76]:
ddd2

      语文    数学  英语
张三  79.0  52.0  58
李四   NaN  58.0  40
王五  46.0   NaN  20
赵六  76.0   7.0  12

In [77]:
#  {'backfill', 'bfill', 'pad', 'ffill', None}
ddd2.fillna(method='bfill', axis=0) # 行的后置填充(用nan之后的值填充nan)

      语文    数学  英语
张三  79.0  52.0  58
李四  46.0  58.0  40
王五  46.0   7.0  20
赵六  76.0   7.0  12

In [78]:
ddd2.fillna(method='ffill', axis=1) # 列的前置填充(用nan之前的值填充nan)

      语文    数学    英语
张三  79.0  52.0  58.0
李四   NaN  58.0  40.0
王五  46.0  46.0  20.0
赵六  76.0   7.0  12.0

In [79]:
ddd2.fillna(method='ffill', axis=1).fillna(method='bfill', axis=1)

      语文    数学    英语
张三  79.0  52.0  58.0
李四  58.0  58.0  40.0
王五  46.0  46.0  20.0
赵六  76.0   7.0  12.0

In [81]:
# 删除nan值
ddd2.dropna()  # 默认情况，删除整行（行内只有存在一个nan -> any() ）

      语文    数学  英语
张三  79.0  52.0  58
赵六  76.0   7.0  12

In [82]:
# axis = {0 or 'index', 1 or 'columns'},
# how = {'any', 'all'}
ddd2.dropna(axis=1) # 删除整个列

    英语
张三  58
李四  40
王五  20
赵六  12

In [84]:
# 删除列值全部都是NaN的整列
# inplace在原有的数据对象上操作，并且返回None
ddd2.dropna(axis=1, how='all', inplace=True)  
ddd2

      语文    数学  英语
张三  79.0  52.0  58
李四   NaN  58.0  40
王五  46.0   NaN  20
赵六  76.0   7.0  12